package faker

var uaFirstNamesMale = []string{
	"Олександр", "Дмитро", "Максим", "Сергій", "Андрій", "Олексій", "Артем",
	"Ілля", "Кирило", "Михайло", "Микита", "Матвій", "Роман", "Єгор", "Арсеній",
	"Іван", "Денис", "Євген", "Данило", "Тимофій", "Владислав", "Ігор", "Володимир",
	"Павло", "Руслан", "Марк", "Костянтин", "Степан", "Григорій", "Федір",
}

var uaFirstNamesFemale = []string{
	"Анна", "Марія", "Олена", "Дарія", "Аліна", "Ірина", "Катерина", "Наталія",
	"Ольга", "Тетяна", "Вікторія", "Юлія", "Поліна", "Ксенія", "Софія", "Валерія",
	"Олександра", "Христина", "Маргарита", "Вероніка", "Світлана", "Діана",
	"Аріна", "Мілана", "Варвара", "Єсенія", "Злата", "Єва", "Стефанія", "Марина",
}

var uaLastNamesMale = []string{
	"Іваненко", "Шевченко", "Коваленко", "Бондаренко", "Ткаченко", "Кравченко", "Коваль",
	"Поліщук", "Мельник", "Петренко", "Олійник", "Савченко", "Романенко", "Лисенко",
	"Павленко", "Семенюк", "Гончаренко", "Бойко", "Білоус", "Василенко",
}

var uaLastNamesFemale = []string{
	"Іваненко", "Шевченко", "Коваленко", "Бондаренко", "Ткаченко", "Кравченко", "Коваль",
	"Поліщук", "Мельник", "Петренко", "Олійник", "Савченко", "Романенко", "Лисенко",
	"Павленко", "Семенюк", "Гончаренко", "Бойко", "Білоус", "Василенко",
}

var uaCities = []string{
	"Київ", "Харків", "Одеса", "Дніпро", "Львів",
	"Запоріжжя", "Кривий Ріг", "Миколаїв", "Вінниця", "Чернігів",
	"Полтава", "Черкаси", "Житомир", "Суми", "Хмельницький", "Чернівці",
}

var uaStreets = []string{
	"вул. Шевченка", "вул. Франка", "просп. Незалежності", "вул. Лесі Українки", "вул. Соборна",
	"вул. Центральна", "вул. Молодіжна", "вул. Садова", "вул. Лісова", "вул. Шкільна",
}
